{
    "status": "success",
    "totalResults": 189,
    "results": [
        {
            "title": "Holly Willoughby struggles to talk as she returns to This Morning after Glastonbury",
            "link": "https://www.mirror.co.uk/tv/tv-news/breaking-holly-willoughby-struggles-talk-30330849",
            "keywords": [
                "TV News"
            ],
            "creator": [
                "mirrornews@mirror.co.uk (Charlotte McIntyre)"
            ],
            "video_url": null,
            "description": "Holly Willoughby could barely speak on Tuesday's This Morning after taking a break to enjoy Glastonbury",
            "content": "Holly Willoughby struggled to speak as she returned to This Morning on Tuesday after partying the weekend away at Glastonbury. The ITV presenter was missing from the sofa on Monday before returning to host alongside Craig Doyle today. Introducing the show, Holly's voice broke as she said: \"Hello, good morning and welcome to your Tuesday This Morning.\" Craig asked: \"What's going on there? A bit of a summer cold? Probably some allergies , maybe a bit pollen?\" \"I've been officially Glasto-ed, this is what this voice is. It's always the first thing to go and I actually blame Elton John for this,\" Holly replied. \"The whole weekend was incredible but to finish with [Elton] and I sang my socks off and now I sound like this.\" Holly returned to This Morning to host with Craig Holly added that she wasn't the only This Morning presenter enjoying themselves at the festival as she shared a snap of Dermot O'Leary. Later in the show, Holly joked about her wild weekend as she and Craig tucked into pineapple on pizza. The presenters were addressing the aged-old question: \"Does pineapple belong on pizza?\" \"This could go one of two ways after my weekend,\" she joked before adding she was quite fond of the controversial dish. Holly warned viewers ahead of her This Morning return that she would be sounding \"croaky\" after her weekend at Worthy Farm. Sharing a picture of her blue midi dress for Tuesday's show, she wrote on Instagram : \"Morning Tuesday… see you on @thismorning with @craigadoyle … may be slightly croaky today [frog emoji] The wonderful @trinnywoodall returns… see you at 10am. #hwstyle dress by @ghostfashion x.\" Holly Willoughby shares first and only Glastonbury snap - before missing This Morning Holly enjoyed Glastonbury with a host of pals One understanding This Morning fan commented: \"Signs of a good weekend x,\" and another remarked: \"\"Yes a weekend of partying at Glasto will do that to you @hollywilloughby.\" \"Looking lovely holly glad you got to have some fun,\" a third added. Holly shared a rare insight into her marriage this weekend with a snap of husband Dan Baldwin as the pair watched Elton's iconic set. The picture showed the pair watching the Pyramid stage as the legendary singer brought Glastonbury Festival to a close. Follow Mirror TV on Twitter and Facebook . Read More Love Island's Zach 'humbled and embarrassed' as he gets rejected by Kady Read More Strictly's Ellie Simmonds shares she was adopted as she reunites with birth mum Read More BBC Breakfast viewers fume over 'wasted money' on 'awful' studio makeover Read More Amazon wants you to delete Spotify with its latest offer Read More 'Bay City Rollers boss was as sick as Jimmy Savile,' new ITV documentary claims",
            "pubDate": "2023-06-27 09:05:09",
            "image_url": "https://i2-prod.mirror.co.uk/incoming/article30330919.ece/ALTERNATES/s615/0_holly-main-glasto.jpg",
            "source_id": "mirroruk",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Duelling docos deliver American Gladiators' jaw-dropping story in diverse ways",
            "link": "https://www.stuff.co.nz/entertainment/stuff-to-watch/300911376/duelling-docos-deliver-american-gladiators-jawdropping-story-in-diverse-ways.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "REVIEW: Part sport, part game show, it was the reality competition that became one of the biggest programmes on the planet in the first-half of the 1990s. Protagonists like Laser, Blaze, Nitro, Ice and Gemini became household names a la pro-wrestlers Jake “the Snake” Roberts, “Macho Man” Randy Savage and Hulk Hogan before them, while viewers of all ages became familiar with regular challenges like the Atlasphere, Human Cannonball, Breakthrough & Conquer, Hang Tough and The Eliminator.",
            "content": "Part sport, part game show, it was the reality competition that became one of the biggest programmes on the planet in the first-half of the 1990s. Protagonists like Laser, Blaze, Nitro, Ice and Gemini became household names a la pro-wrestlers Jake “the Snake” Roberts, “Macho Man” Randy Savage and Hulk Hogan before them, while viewers of all ages became familiar with regular challenges like the Atlasphere, Human Cannonball, Breakthrough & Conquer, Hang Tough and The Eliminator. Without it, it’s arguable there would be no or . In New Zealand, American Gladiators became a Friday night staple, deemed unlikely to cause quite as much playground mayhem as the WWF (the one with the Bushwackers, not the Panda logo), with Kiwi audiences cheering on their favourite muscle-bound “gladiator”, or plunky contenders like Wesley “Two Scoops” Berry. Now, as seems Hollywood tradition, there are two new, “duelling” documentary series looking at the legacy of the show. But while they cover plenty of similar ground, Netflix’s five-part, 208-minute Muscles & Mayhem: An Unauthorised Story of American Gladiators (which begins streaming on the evening of Wednesday, June 28) and ESPN’s two-part, 170-minute The American Gladiators Story (which next screens at 10.30am that same day) take very different approaches. Helmed by former Napoleon Dynamite and Nacho Libre director Jared Hess and Emmy Award-winner Tony Vainuku (2015’s In Football We Trust), Muscles is a VH1 Behind the Music-style soup-to-nuts account of Gladiators’ rise and fall. While it mostly plays out in chronological order, it definitely likes to tease its more jaw-dropping revelations and is filled with plenty of memorable one-liners: “We learned quickly that we were going to need more than band aids,” Michael Horton aka Gemini reflects on the production’s early extremely lax attitude towards safety. He’s one of an impressive number of key players the Muscles team have managed to corral together, all more than willing to spill the tea on what really went on when the cameras were (and weren’t) rolling. You’ll learn how only two of the pilot’s gladiator sextet made it to the series, see footage of trialled, but rejected games involving a Velcro wall and a trampoline (as well as an ill-conceived, thankfully short-lived “executioner referee”) and relive some of the brutal collisions that ended the gladiatorial careers of former racquetball champion Malibu and Olympic cyclist Sunny. What comes across is just how cobbled together the original conceit was. The pilot was shot in an equestrian centre, “protection” was a combination of modified motorcycle and baseball gear and no medical staff were employed. Bizarrely, bankrolling production was the Samuel Goldwyn Company, best known for producing independent movies like Sid and Nancy, Mystic Pizza and Wild at Heart, than a prime-time sports spectacle. So chaotic and embarrassing was the first footage, that many working on the pilot were convinced that they wouldn’t be picked up, especially when their main rival – Rock and Roller Games – was a heady combination of musical performances and roller derby with a live alligator thrown in for good measure. And even when they somehow managed to secure a syndication deal, it was initially derided by the American media, who described it as “crash TV” and heralding “the demise of not only television, but civilisation”. They even struggled to find crowds for their recordings, essentially “kidnapping” families off the famous Universal Studios tour. After just 13 episodes, they looked done, until Bob Levy and Eytan Keller were brought in to overhaul the show. While the latter retooled the games and ensured safety protocols were put in place, Levy introduced “immersive” innovations like helmet cams. When Gladiators returned, it was a far slicker product and viewers almost instantly became addicted. But, as Muscles shows, that was by no means the end of the drama. Fast-paced and filled with a deep bench of colourful characters (as well as a cadre of the Gladiators themselves, key members of the production team also feature), Muscles makes clever use of animated sequences for the rare moments where they don’t have archival footage to match its interviewees’ detailed, sometimes hilarious, often hair-raising, but never dull, accounts. Contrast that with ESPN’s Story, which is far more of a documentary about making a documentary. Barely mentioned in passing in Muscles, Ben Berman and Kirk Johnson’s tale places Eerie, Pennsylvania gym owner, Elvis impersonator and self-proclaimed American Gladiators creator Johnny Ferraro front-and-centre. Clearly a somewhat opinionated and controversial figure (when asked about all the significant injuries that occurred on set, he shrugs them off with a glib, “you can’t taste glory, without a little pain”), what his presence does bring is a chance for the film-makers to delve into where the idea that inspired the show came from. On the flipside, the Ferraro focus apparently dissuaded many of the gladiators from being a part of this project, with the likes of Nitro and Laser reduced to narrated excerpts from their books, or archival audio from other sources. That though, does allow other voices to be heard. Contestants like Wesley “Two Scoops” Berry recount how appearing on the show changed their life, while Sports Illustrated journalist Austin Murphy looks back on the time he went undercover to write about the audition process and one of the “second-tier” gladiators reveals just how reviled they were by the live audiences when they were subbed in for the injured front liners (signs like “Viper wears a diaper” apparently not great for one’s self-confidence). Story isn’t short on big revelations either. There’s the time a contestant needed around 150 internal and external stitches when an Atlasphere broke, how leaf blowers were used to inflate mats when the show went on a nationwide tour and the amazing footage of gladiator Sabre (who had a beef against the LAPD) telling global audiences just how good it felt “to hit a cop”. But with Ferraro seemingly constantly goading the film-makers (“are you going to tell the right story?”), the documentary eventually becomes more about an investigation into his various claims about how Gladiators came to be. “Two guys from Eerie, Pennsylvania changed the way we watch television,” he proclaims at one point, but whenever Berman asks him about his fellow Eerie resident Dan Carr (who used to run Gladiator-style live events as far back as 1982), he’s evasive, ultimately refusing to allow the Story team access to him. Used to and indeed fascinated by such behaviour (one of Berman’s last documentaries was the incredible and bizarre tale of “dying magician” The Amazing Johnathan) – it’s perhaps no surprise that the co-director decides to pursue that, rather than stick to a traditional history-of-the-show narrative. While one can’t help but feel that it’s a little ironic that a documentary on a sports network ends up eschewing the athletes, ultimately both it and Muscles are entertaining, engrossing watches that also show just how a single narrative can be told in very different ways.",
            "pubDate": "2023-06-27 08:45:00",
            "image_url": null,
            "source_id": "stuff",
            "category": [
                "top"
            ],
            "country": [
                "new zealand"
            ],
            "language": "english"
        },
        {
            "title": "Passengers left stranded after 900 flights cancelled as storm hits New York City",
            "link": "https://www.mirror.co.uk/news/us-news/breaking-passengers-left-stranded-after-30295694",
            "keywords": [
                "US News"
            ],
            "creator": [
                "mirrornews@mirror.co.uk (Liam Buckler)"
            ],
            "video_url": null,
            "description": "Newark Liberty International Airport had around 900 combined cancellations and delays, LaGuardia Airport had about 800, and John F. Kennedy International Airport had nearly 750",
            "content": "Over 900 flights have been cancelled after stormy weather hit New York City causing major disruption across the airlines. Newark Liberty International Airport had around 900 combined cancellations and delays, LaGuardia Airport had about 800, and John F. Kennedy International Airport had nearly 750, according to FlightAware. And on Monday night, more than thirty per cent of the flights out of Newark were scrapped, and nearly forty per cent were delayed due to the stormy weather . The National Weather Service issued tornado and severe thunderstorm warnings across most of New Jersey yesterday afternoon. Neighbour arrested after bloody footprints left at scene of brutal murder of elderly couple on their anniversary Passengers have been left stranded ( Image: CBS News) Officials admitted the delays and cancellations were particularly bad at LaGuardia and warned the disruption could last for the next few days. The cancellations have left many passengers trapped including Peggy Paradice who was set for a 30-hour flight back home to Australia when it suddenly turned into a four-day journey. She told CBS News : \"It must be really bad because a lot of airlines just have no seats until Thursday. So here we are. We're camped out in the Newark Airport. \"So this is us putting our toe back in the shark-infested waters of air travel.\" The weather has caused delays for passengers ( Image: Getty Images) She revealed it was her first trip to the US since the pandemic. \"So this is us putting our toe back in the shark-infested waters of air travel,\" Peggy added. Peggy admitted she will have to revaluate their plans over the coming days as airlines admitted the disruption could last until Tuesday. Egan Budd, from Seattle, had spent nearly 24 hours inside Newark Airport as she awaited more information on her flight after nearby hotels had been sold out due to the disruption. Hundreds of flights have been delayed ( Image: CBS News) \"I feel gross. I feel like I want to cry, but I have nothing left. I called all the hotels within three miles of the airport and they were like, no, we're full, no, we're full.\" According to the Port Authority, the weather delays on Monday and the cancellations on Sunday created further disruption for passengers. Authorities recommend passengers check the status of their flight with their airline before heading to the airport on Tuesday so they can avoid lengthy waits. The weather on Wednesday and Thursday will be unsettled but the threat of severe thunderstorms will remain low, according to the National Weather Service. Read More Fury as new rule for pizza chefs in New York could drastically change the taste Read More Woman shares horror reaction from sun poisoning after she fell asleep on beach Read More Couple celebrating their 50th anniversary brutally murdered in their home Read More Terrifying moment fisherman runs for safety after alligator lunges at him Read More Gay club 'monster' who gunned down five gets life in prison, victim says ‘devil awaits’ shooter",
            "pubDate": "2023-06-27 08:30:40",
            "image_url": "https://i2-prod.mirror.co.uk/incoming/article30330561.ece/ALTERNATES/s615/0_Mondays-storms-cause-delays-cancelations-at-airports-across-Tri-State-Area.jpg",
            "source_id": "mirroruk",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "DDSG Blue Danube: Themenfahrten im Juli 2023",
            "link": "https://www.ots.at/presseaussendung/OTS_20230627_OTS0076/ddsg-blue-danube-themenfahrten-im-juli-2023",
            "keywords": [
                "Chronik"
            ],
            "creator": [
                "PID Presse- und Informationsdienst der Stadt Wien"
            ],
            "video_url": null,
            "description": "Start in die Sommersaison mit spannenden Schifffahrten",
            "content": "Wien (OTS/RK) - „Glücksmomente am Schiff“ – unter diesem Motto legt die aus sieben modernen Schiffen bestehende DDSG Blue Danube-Flotte zu unzähligen Schifffahrten am Tag und am Abend ab. Egal ob eine gemütliche Schifffahrt durch das UNESCO-Weltkulturerbe Wachau, eine Sightseeing Cruise am Wiener Donaukanal oder eine Themenfahrt mit jeder Menge Unterhaltung und kulinarischer Vielfalt – an Bord der DDSG Blue Danube stehen Entspannung, Erholung und Erlebnis im Vordergrund. Bei den sommerlichen Themenfahrten der DDSG Blue Danube locken abwechslungsreiche Attraktionen kombiniert mit den dazu passenden lukullischen Gaumenfreuden und der entsprechenden musikalischen Begleitung zu einem einzigartigen Abend auf sanften Donauwellen. Die MS Admiral Tegetthoff bietet im Juli 2023 eine Reihe an großartigen Themenfahrten an. Die größten ABBA-Songs und Smörgasbord, ein typisch schwedisches Buffet, gibt es am 7. Juli im Rahmen der Schwedischen Nacht mit ABBA-Hits. Am Donnerstag, den 13. Juli, lädt das Schiff zur „Griechischen Nacht“ ein. Eine griechische Live-Band rund um Olga Kessaris bringt Stimmung an Bord, während mediterrane Leckereien wie Tzatziki, Souvlaki, Keftedes, Moussaka & Co. den Gaumen verwöhnen. Pasta, Pizza & Tiramisu – einen lockeren Italo-Abend mit passender musikalischer Begleitung kann man mit der „Italienischen Nacht“ am Samstag, den 22. Juli, erleben. Jeden Donnerstag um 19.00 Uhr geht die MS Wien auf die beliebte Heurigenfahrt mit Wiener Liedern. Am Beginn der Fahrt, wenn sich die Gäste am hervorragenden Buffet bedienen, spielen Wiener Musiker*innen dezent im Hintergrund. Nach dem Essen geht die Band von Tisch zu Tisch und erfüllt die traditionellen musikalischen Wünsche der Gäste. Beim Buffet werden kalte & warme Heurigenspezialitäten mit typischen Wiener Schmankerln wie Schnitzel, Aufstrichen, Apfelstrudel und Kuchen angeboten. Am 12. und 26. Juli findet die neue Sunset Barbecue Cruise an Bord der MS Kaiserin Elisabeth statt. Das großzügige Sonnendeck der imposanten MS Kaiserin Elisabeth lädt zu einem Aperitif vor eindrucksvoller Kulisse mit 360-Grad-Panoramablick auf die Wiener Skyline und das reiche Buffet bietet köstliche Grillspezialitäten an. Den Sonnenuntergang begleiten mit unterhaltsamer Live-Musik, jeweils an unterschiedlichen Terminen, die stimmgewaltige Caroline Kreutzberger, Saxolady Daniela Krammer oder die Band „Lady & The Keys“. Krönender Höhepunkt der abendlichen Sommer-Cruise ist das von der DDSG Blue Danube organisierte farbenfrohe Feuerwerk. Am 16. Juli 2023 um 11.00 Uhr wartet die DDSG Blue Danube mit dem „Boozy Brunch“ auf. Köstliche Brunch-Cocktails, wie zum Beispiel Bloody Mary, Mimosa, Prosecco oder alkoholfreie Getränke werden vor der eindrucksvollen Kulisse der Wiener Skyline angeboten. Brunch-Fans kommen bei der großen Auswahl am Buffet auf ihre Kosten: Ob süß oder herzhaft, von klassischen Eiergerichten bis hin zu frischen Obst- und Joghurtvariationen ist sowohl für Fleischliebhaber*innen als auch für Vegetarier*innen etwas dabei. Die Brunch-Cruise begleitet mit schwungvoller Live-Musik die stimmgewaltige Caroline Kreutzberger. Musical-Lieblinge hautnah mit Panoramablick auf die Wiener Skyline: Bei der neuen Themenfahrt „Musicalstars in Concert“ der DDSG Blue Danube können Passagiere ab Juli 2023 drei Musicalgrößen hautnah erleben und dabei die idyllische Abendschifffahrt mit Ausblick auf die Wiener Waterfront genießen. Den Auftakt macht die gebürtige Holländerin Maya Hakvoort am 17. Juli 2023. Ein Drei-Gänge-Menü rundet das Kulturspektakel auf Donauwellen ab. Alle Themenfahrten im Juli 2023 im Überblick: www.ddsg-blue-danube.at/themenfahrten-wien/ Die Fotos zur Aussendung sind im Pressebereich der Wien Holding unter www.wienholding.at/Presse/Presseaussendungen abrufbar. Honorarfreier Abdruck im Zuge der Berichterstattung unter Nennung des Copyrights. Marlies Brenn leisure communications Tel.: 0664 856 30 03 E-Mail: mbrenn @ leisure.at www.leisure.at/presse Alexander Hirschmann Wien Holding – Corporate Communications Tel.: 01 408 25 69 - 13 E-Mail: a.hirschmann @ wienholding.at www.wienholding.at OTS-ORIGINALTEXT PRESSEAUSSENDUNG UNTER AUSSCHLIESSLICHER INHALTLICHER VERANTWORTUNG DES AUSSENDERS | NRK0007",
            "pubDate": "2023-06-27 08:19:10",
            "image_url": null,
            "source_id": "ots",
            "category": [
                "top"
            ],
            "country": [
                "austria"
            ],
            "language": "german"
        },
        {
            "title": "Lost on Me",
            "link": "https://lithub.com/lost-on-me/",
            "keywords": [
                "Daily Fiction",
                "Excerpts",
                "Fiction and Poetry",
                "From the Novel",
                "Novels",
                "Black Cat",
                "Excerpt",
                "Grove",
                "Leah Janeczko",
                "Lost on Me",
                "translation",
                "Veronica Raimo"
            ],
            "creator": [
                "Lit Hub Excerpts"
            ],
            "video_url": null,
            "description": "My brother and I both became writers. I don’t know what he answers when people ask him why that is. I say it’s thanks to all the boredom our parents imparted to us. While my mother had high anxiety, my father had a subtler form of paranoia. His chemistry studies made him see the world […]",
            "content": "My brother and I both became writers. I don’t know what he answers when people ask him why that is. I say it’s thanks to all the boredom our parents imparted to us. While my mother had high anxiety, my father had a subtler form of paranoia. His chemistry studies made him see the world as a petri dish of harmful substances we constantly needed to protect ourselves from. This meant leaving the house as little as possible, suffocating within four walls—or, in our case, a hundred. I was eight at the time of the nuclear reactor meltdown in Chernobyl. Even when the emergency seemed to be over, my family continued to exist in a postapocalyptic film scenario, pretending we lived not in a relatively well-off city in the Western world, but in a sci-fi Zone X with high levels of contamination. In every respectable catastrophe story, when the world’s been infected, all that matters is preserving one’s blood ties: the family. And so for three years my father didn’t let us eat fruits, vegetables, or eggs, or drink milk, or go out to restaurants, or buy pizza from street vendors. The only foods allowed were canned goods dated before April 26, 1986. It wasn’t easy to follow this protocol, but I must confess that it made things interesting, made me feel like a heroine living in a state of quarantine invisible to the rest of the world. Staying entrenched in our secure apartment, eating tuna and beans like the pioneers, coming up with outlandish excuses to turn down a snack when studying at a classmate’s, or checking the packaging dates at the supermarket as though they were secret codes meant just for us, the chosen few. We all ended up with a pretty bad vitamin deficiency, and though my mother drugged us with Be-Total and Co-Carnetina, we were all a bit green around the gills. Still, we survived. Worst-case scenario, we risked coming down with scurvy. * Thanks to our strict upbringing, neither my brother nor I ever learned to do such hazardous things as swimming, riding a bike, skating, or jumping rope (in a flash we might have drowned, cracked our skulls, broken a leg, strangled ourselves). We spent our childhood cooped up at home, bored off our asses. It was such an all-consuming activity that it soon became an existential pose. We knew how to be bored like nobody’s business. In our building there were always kids playing down in the courtyard, and their shouts and cries reached our ears like some strange animal language we didn’t understand. We would spy on them from our sliver of a window, in silence, the lights out. We would take turns raising our faces a few centimeters above the windowsill (there wasn’t room for us both) to then duck down if one of the kids looked up as they followed the arc of a ball sailing through the air. We were terrified by the thought that they might see us, because we wouldn’t have known how to handle an invitation to join them. Two little spies barricaded inside their home. The worst part is we never even saw ourselves that way. I mean, we could’ve turned it into a game—“Ha! They didn’t see us!”—enjoyed the thrill of not getting caught, debating who was the cutest boy or girl in the group, at least as much listless diversion as old men staring at a construction site. But no, not even that. We were just two kids who were really good at being bored off their asses. One day, from the secrecy of our hiding place, we faced an appalling moral dilemma. The kids in the courtyard were playing soccer with a toad. At first the animal was simply placed in the middle of them all, surrounded, like the typical loser in an episode of adolescent bullying. The toad hazarded a couple leaps, but it clearly had no escape plan. Then, from the circle of legs, the first kick swung out. They started dribbling it to one another. What reached our outpost were more the idiotic little shouts of humans than the thump of a shoe making impact against the creature’s warty flesh, or the splat of its body against the asphalt when someone missed a pass, but in my head it was all loud and clear. My brother and I squeezed each other’s hands throughout that endless torment. I think he was praying. I could hear him mumbling litanies, though he didn’t make the sign of the cross because I wouldn’t let go of his hand. I just wished the toad would die quickly and put us out of our misery. We couldn’t breathe. Or better, we deliberately chose not to. Cowardly and hopeless, as always. So was that what our parents were trying to protect us from? The discovery of evil in our own courtyard? The horror, the horror! * When we finally discovered books, it wasn’t a form of escapism, but rather the reassuring coalescence of boredom. I could almost picture it in my mind, white and miry: reading was like sinking into a pool of milk. I would stay immersed for hours, until even my body grew flaccid, the stagnant liquid seeping into my pores. It felt like everything suddenly acquired meaning, a phenomenon of transubstantiation, my flesh changing into boredom. I couldn’t say whether I liked a book. That was never the point. In fact, I imagined that attempting to derive any pleasure from reading would have been a lost cause. Why bother trying? Besides, there was one thing my family feared even more than the toxic cloud from Chernobyl: hedonism. * Before books came along to dope us with boredom, my brother and I came up with other pastimes. The family genius had invented a game that took up our afternoons for several summers. From right after lunch-time until the sun went down, and up to the point when we needed to go have dinner, we would lie on the floor side by side, propped up on our elbows with a notebook in front of us to play the numbers challenge. We didn’t play against each other but beside each other, because the game wasn’t competitive. Actually it wasn’t collaborative either. It was more like the Zen exercise of counting sheep jumping over a fence when you were trying to fall asleep. You rolled a die and marked down the number that turned up. We spent hours doing it. Committed, engrossed. We were both big fans of five, so the only real highlight of the game was hoping the five turned up as often as possible. Which showed its superiority. As I rolled my die, I would peek at my brother rolling his, would sense in his focused gaze the hope that it would be a five, followed his steady, honest hand marking an X below the number four. Barely a glimmer of regret in his eyes and then, with perfect faith, ready for the next roll. Careful not to be seen, I would mark an X in my notebook below the five, lowering a curtain of fingers in front of my die, which had landed on a pitiful two. I was capable of cheating at a Zen game. It was senseless. Still, I couldn’t help it. When my parents called us to dinner and he and I compared notes, my five always came out the winner. I don’t know if my brother knew I was cheating, or if he couldn’t even have fathomed anything so petty. He tried to decipher the data and was surprised at how it defied all statistical probability. He tried to discern another possible logical explanation, attempted his first forays into metaphysics. How could I have rolled a five so many times? Then he would pat me on the back and say, “Brava.” I’ve often thought about that “brava.” I’ve wondered whether it was due to the principle of communicating vessels, whether my brother needed to force out a “brava” or two every so often to make room for all the others being directed at him. I’ve also wondered if it was one of his first manifestations of sarcasm. Involuntary, perhaps. I’ve wondered whether he actually wanted to tell me “brava” to praise my silly trick, my attempt to overcome the boredom of his inane game by doing something even more inane. Whether he was trying to say to me: how can we escape this bedroom? How can we break free? Actually, that’s what I’ve been doing my whole life. Whenever I feel like I’m trapped in a room, in a game with rules rather than trying to escape from it I try to taint the logic of the room, of the rules. To imagine things that aren’t true, to say them, cause them, until I believe them. Until I believe a die can always turn up five, even though it makes absolutely no difference at all. __________________________________",
            "pubDate": "2023-06-27 08:16:01",
            "image_url": null,
            "source_id": "lithub",
            "category": [
                "entertainment"
            ],
            "country": [
                "united states of america"
            ],
            "language": "english"
        },
        {
            "title": "Live Q&A: Join our sex, love and dating 'masterclass'",
            "link": "https://www.stuff.co.nz/life-style/wellbeing/300914074/live-qa-join-our-sex-love-and-dating-masterclass.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "The Good Sex Project is proudly brought to you by Hell Pizza. Do you need some expert help when it comes to love, dating, sex, or maintaining a healthy relationship? From 8pm on Tuesday, join our live Masterclass with the host of The Good Sex Project podcast, Melody Thomas. Melody will be joined by clinical psychologist and family therapist Nic Beets and together they will be taking questions from our readers and listeners.",
            "content": "From 8pm on Tuesday, we held a Masterclass with the host of The Good Sex Project podcast, Melody Thomas. Melody was joined by clinical psychologist and family therapist Nic Beets and together they took questions from our readers and listeners. Have you got something you've been wanting to know? Email",
            "pubDate": "2023-06-27 07:45:00",
            "image_url": null,
            "source_id": "stuff",
            "category": [
                "top"
            ],
            "country": [
                "new zealand"
            ],
            "language": "english"
        },
        {
            "title": "Lovac na pizze u jednoj od najboljih pizzerija na svijetu: Što se same pizze tiče...",
            "link": "https://www.index.hr/food/clanak/lovac-na-pizze-u-jednoj-od-najboljih-pizzerija-na-svijetu-sto-se-same-pizze-tice/2474145.aspx",
            "keywords": [
                "Food"
            ],
            "creator": null,
            "video_url": null,
            "description": "IAKO VEĆ nekoliko godina uporno planiram posjetiti Napulj, učinio sam to tek ove godine nakon što sam pozvan na Campionato Mondiale del Pizzaiuolo. Na put smo krenuli automobilom jer smo željeli obići i neka obližnja mjesta, poput Positana, Amalfia i Caserte.",
            "content": "IAKO VEĆ nekoliko godina uporno planiram posjetiti Napulj, učinio sam to tek ove godine nakon što sam pozvan na Campionato Mondiale del Pizzaiuolo. Na put smo krenuli automobilom jer smo željeli obići i neka obližnja mjesta, poput Positana, Amalfia i Caserte. Osijek, Zagreb, Ljubljana, Venecija, Bologna, Firenca, Rim, Napulj. Trebalo nam je oko 14 sati za tih 1400 kilometara uz dva kraća stajanja. Nisam napravio nikakav plan, a želja mi je bila posjetiti što više pizzerija sa svjetske TOP 100 liste. U prvih deset na toj listi je pet napuljskih pizzerija. Prvoplasirana I Masanielli zapravo se nalazi u Caserti, mjestu udaljenom dvadesetak kilometara od Napulja. Budući da smo u Napulj stizali u večernjim satima, odlučili smo se za 50 Kalo, četvrtu s liste i jednu od najpoznatijih svjetskih pizzerija. 50 Kalo nalazi se blizu duge gradske šetnice uz obalu na zanimljivoj lokaciji, a otvara se u 19:30 pa smo umjesto adrese hotela u GPS upisali adresu pizzerije. Ne znam jeste li ikad vozili po Napulju, a ako jeste, nadam se da ste preživjeli. Kad bih u igri asocijacija morao s nekoliko riječi opisati promet u Napulju, napisao bih - totalni kaos, ludilo i lutrija. Nema prometnih traka, nema ni minimuma prometne kulture, ne poštuju se prometni znakovi, raskrižje prvo prolaze jači, hrabriji, snalažljiviji i luđi. I oni u većim i bržim automobilima. Skuteri i motori izviru sa svih strana, voze u svim smjerovima, odvaljuju bočne retrovizore, prelaze vam preko haube… Stigli pred 50 Kalo živi i zdravi Sve u svemu, nakon oko sat vremena zastrašujućeg vozačkog iskustva stigli smo pred 50 Kalo. Stao sam sa sva četiri žmigavca ispred pizzerije, što je izazvalo zbunjenost, čuđenje i ljutnju ostalih vozača pa sam ih ubrzo ugasio, a Ivana je izašla i otišla pitati kakve su šanse da dobijemo stol za dvoje. Smatrao sam kako nema smisla tražiti parking u blizini ako ne dobijemo mjesto. 50 Kalo ima dio stolova koje čuva za walk-in goste poput nas pa nas je djelatnica na ulazu upisala i rekla nam da dođemo za oko sat vremena. Ispred pizzerije stalno čeka između dvadeset i trideset gostiju. Kako se koji stol oslobodi, ulaze novi gosti. Nakon beskonačno dugog kruženja i pokušaja vožnje po okolnim ulicama pronašli smo parking u blizini, dvjestotinjak metara od pizzerije. Tu smo udaljenost prošli pješke za samo pola sata. Shvatili smo kako se cesta prelazi bilo gdje, a ako je prelazite na pješačkom prijelazu, onda su vam veće šanse da je prijeđete dok je na semaforu crveno svjetlo. Veće su vam šanse za preživjeti. Iako smo pred pizzeriju stigli u vrijeme koje nam je ponuđeno i upisano na listu, čekali smo dodatnih desetak minuta. To je očito uobičajena praksa budući da je tridesetak ostalih gostiju koji su poput nas čekali svoj stol mirno stajalo, pušilo i razgovaralo na ulici ispred pizzerije, nije bilo tenzija i loše atmosfere. Dobili smo stol na vanjskoj terasi, a prvo što smo primijetili bila je nevjerojatna uigranost konobara i kompletne ekipe. Čim smo sjeli, stigli su nam jelovnici i pribor, odmah smo naručili piće koje se pojavilo na stolu u samo par minuta, a pizze su stigle doslovno tri ili četiri minute nakon narudžbe!? Nismo još nikada doživjeli tako brzu, uigranu i profesionalnu uslugu. Kasnije sam vidio da 50 Kalo ima nekoliko vrhunskih peći i nekoliko pizza majstora na svakoj. A sad malo o pizzama 50 Kalo u svojoj ponudi ima tridesetak pizza, koje su podijeljene na frite, klasične pizze i pizze s povrćem (vegetarijanske). Mi smo naručili dvije nešto lakše - Melanzane e Provola, s patlidžanima i gljivama u umaku od datulje, i Spinaci, Burro e Parmigiano, s nekoliko vrsta sireva i špinatom. Pizze su uistinu vrhunske, ali meni se tijesto nije baš pretjerano svidjelo, bilo je nekako nedorečeno za tako visoko rangiranu pizzeriju. Možda sam imao prevelika očekivanja, a možda su i umor od dugog puta i pretjerana glad ipak učinili svoje i otežali mi objektivnu i kvalitetnu procjenu. Nadjevi su bili savršeni. Pizza je nešto između tradicionalne i moderne napoletane, ima nešto deblje, ali ne predebele rubove, a nadjevi su poprilično sočni i pomiješani s tekućinom iz sireva. Cijene Cijene pizza kreću se od 6 eura za Marinaru i Cosaccu do 9.50 eura za one najskuplje. Većina je pizza između osam i pol i devet i pol eura. To definitivno potvrđuje komentare onih koji uporno ponavljaju kako su pizze u Napulju puno jeftinije nego kod nas. Naravno, tu dolazimo i do onog famoznog ali. Same pizze jesu jeftinije, ali vas na kraju račun dođe skuplje nego u Hrvatskoj, a u to smo se kasnije uvjerili u svim pizzerijama u kojima smo bili. Napuljske pizzerije naplaćuju dva do tri eura kuver po osobi, neke na računu odmah naplate i napojnicu od oko 10 %, a piva i vina su im brutalno skupa. Želite li pojesti dobru pizzu u vrhunskoj pizzeriji u Napulju i uz nju popiti pivo ili čašu vina, platit ćete u konačnici više nego u Hrvatskoj. Pizzu u 50 Kalo mogli smo uzeti i za van pa je pojesti na haubi auta ili na klupi u obližnjem parku. Tada bi definitivno bila jeftinija od nekih pizzerija u Hrvatskoj. Sve u svemu, 50 Kalo stvarno zaslužuje biti visoko rangiran na svjetskim top listama iako je što se same pizze tiče najlošija od svih napuljskih pizzerija koje smo kasnije posjetili. Ako vas put odvede u Napulj, a volite pizzu, obavezno posjetite ovu pizzeriju, koja je već godinama u samom vrhu svih top ljestvica.",
            "pubDate": "2023-06-27 07:35:00",
            "image_url": null,
            "source_id": "index_hr",
            "category": [
                "top"
            ],
            "country": [
                "Croatia"
            ],
            "language": "croatian"
        },
        {
            "title": "The Surprising UK Foodie Destination You’re Probably Overlooking",
            "link": "https://thelatch.com.au/things-to-do-bath/",
            "keywords": [
                "Lifestyle",
                "Restaurants",
                "Travel"
            ],
            "creator": [
                "Natasha Bazika"
            ],
            "video_url": null,
            "description": "Savour seaweed pizza dough in the oldest house in Bath. The post The Surprising UK Foodie Destination You’re Probably Overlooking appeared first on The Latch.",
            "content": "by Natasha Bazika URL Copied! My initial journey to Bath was fueled by literary inspiration, drawn from the hallowed pages of Geoffrey Chaucer’s Canterbury Tales and the timeless prose of Jane Austen. Armed with their verses and iambic pentameter, I eagerly anticipated stepping foot into the historic city, where the Roman Baths, Pulteney Bridge, and the Abbey I had read about would be. However, amidst these iconic landmarks, a delightful surprise awaited, unravelling an unexpected twist in my tale — Bath’s culinary realm. googletag.cmd.push(function() { googletag.defineSlot('/22219324693/thelatch/teads', [1, 1],'gam_teads') .setTargeting('pos', 'teads') .addService(googletag.pubads()); googletag.display('gam_teads'); }); My culinary expectations for Bath were tempered. Its gastronomic reputation was not yet mainstream, which is a missed opportunity if you ask me. Yet, my trip to Bath revealed an unanticipated haven for discerning food enthusiasts, offering a contemporary gastronomic experience that surpassed all expectations. Within the age-old sandstone buildings are world-class restaurants, hidden gin bars and pizzerias boasting unconventional menus. Bath’s culinary landscape is a tapestry of delightful surprises, and I have just the guide to help you savour the remarkable fusion of tradition and innovation that defines this unexpected epicurean paradise. Bath Food Heroes Tour Navigating Bath is best done with a tour guide, whether it’s an audio tour of the Roman Baths or a guided food tour by a local. I entrusted Savouring Bath to guide me through the city’s culinary heritage on a “Food Heroes” tour. I won’t spoil the stops because the tour guides love to see guests’ reactions first-hand, but I can give you a taste of what to expect, at least on the “Food Heroes” tour. During the 3.5-hour tour, I encountered legendary local specialties, including a bun in one of Bath’s first houses and innovative culinary pioneers driving the current food scene, from cheesemongers to an Australian breakfast staple in a pocket-sized corner store. Photo: The Elder The Elder The last place I’d expect to find any concept of multi-course fine dining is Bath, but there I was, eating my words at The Elder . Helmed by esteemed restaurateur Mike Robinson, renowned as the United Kingdom’s foremost authority on wild food and game, The Elder is where the boundaries between the kitchen and the wilderness blur. The dining experience is a profound celebration of the land’s offerings, an ode to the seasons that unfold, and a testament to the extraordinary possibilities that arise when sustainability and culinary excellence intertwine. The tasting menu is a must. Although it changes seasonally, my dinner encompassed a range of local vegetables, delicate savoury tarts, meaty game main, and of course, a light dessert to finish. There was even an amuse-bouche of warm broth to drink. Dough Stumble down a cobblestone lane in the heart of the city, and you will find Dough . There are actually two locations, one in The Corridor and one in Kingsmead Square. Either one serves traditional Italian cuisine and pizza with a twist. The twist being the base. You can order a seaweed base dough. Actually, you can order 12 bases. Yes, 12. They love to play around with bases, not only for dietary requirements but also for something different. You can get turmeric, hemp, grano arso, chocolate, and plenty more dough varieties. Just pick your pizza topping, from the Mediterranean to Napoletana and choose a base. I recommend the seaweed base. It’s different but tastes incredible. The Scallop Shell Looking for the best fish and chips in Bath? Venture to The Scallop Shell . Again, a recurring theme of casual dining spaces dominates here, with colourful distressed furnishings in a wood-dominated structure. Grab a seat upstairs or settle in downstairs by the open kitchen. The menu boasts a range of local seafood dishes, but they’re best known for their fish and chips. The fish is plump and fried to a golden crisp, served with equally as crunchy chips and a spoonful of homemade tartare. There’s also a little ramekin of mushy peas because it’s the UK. The Coconut Tree on Broad Street Fancy some Sri Lankan fare in Bath? The Coconut Tree on Broad Street is driven by a fervent desire to introduce the distinct flavours of Sri Lanka to the global stage. Nestled within a laid-back ambience reminiscent of an island getaway, this vibrant establishment entertains diners with an eclectic selection of tunes daily. Photo: ArtBar ArtBar at Abbey Hotel Hiding inside the Abbey Hotel is a swanky cocktail bar by the name of ArtBar . Walk through the grand sandstone building entrance and make your way to the back of the building to find a wall of bottles, art, and bright colours. Pull up a stool and peruse the cocktail menu or get cosy in a lounge with a bottle of wine and good company. The Bath Distillery Another cosy place to drink in Bath is the Bath Distillery Gin Bar , a dimly street-level bar. The cocktails here are the definition of craft. Inspired by literary heroes, local ingredients, and local lore, you will find a long list of cocktails centred around Bath Gin. If you’re not feeling a cocktail, you can choose a gin and flavour pairing, and the mixologists will work their magic. If you’re a lover of gin and all think G&T, this bar is a must-visit. Photo: The Dark Horse The Dark Horse Formerly a local’s secret, The Dark Horse can only be described as a bijou drinking den surrounded by artwork, antique furniture, and world-class cocktails. Did I mention the owner’s friend creates the artwork? It’s as quirky a basement bar as you’ll get. Sub 13 Every city has its nightclub. In Bath, that nightclub is Sub 13 . The stylish cellar bar has a courtyard space to take in those balmy afternoons and a ground-floor cocktail bar, and a basement club for all your dancing needs. The Hideout I’ve covered gin and cocktails, but I haven’t mentioned whisky. When it comes to the golden libation, The Hideout is the place to go. This upscale haunt is the purveyor of fine whisky. Make your way down the historical lanes of Tudor Bath and step into this true hole in the wall that was once a haven for outlaws. Other Things to Do Bath Insider Tours Apart from the copious amounts of good food and drink consumed on this trip, I also explored between meals. One such tour I took is the Bath Insider Tour , a self-guided walking tour of Bath’s picturesque side, away from the bustling city tour. The tour managed through the app includes GPS tracking, which is how I want to do all my walking tours from now. Pop in some earphones, and enjoy the soothing sounds of a digital guide to help you trace the steps of a bygone era. Marvel at the iconic Pulteney Bridge and wander along Bath’s longest boulevard. Traverse the enchanting Sydney Gardens and relish a scenic promenade along the historic Kennet and Avon Canal. This captivating tour spans approximately 90 minutes and is the best tour in Bath. The Roman Baths Visit one of the best-preserved Romain remains in the world, The Roman Baths . Meander through ancient chambers and well-preserved ruins and take in the grandeur of this ancient social complex. An audio tour is the best way to uncover fascinating stories and immerse yourself in the rich heritage of this iconic attraction. Bath Abbey At the heart of the city stands Bath Abbey , an architectural marvel and prime example of Gothic architecture at its finest. Step inside this sacred space and be mesmerised by the soaring vaulted ceilings and stained glass windows, or tackle the climb to the top, which has approximately 200 narrow and, at times, steep steps. Although, the views from the top are worth it. Discover its rich history, from its origins as a Benedictine monastery to its restoration during the Victorian era. Where to Stay There are a few accommodation options in Bath, but if you’re looking for something historic, something charming, and with contemporary upgrades, consider Hotel Indigo Bath . With its distinctive Georgian Terrace facade and stylish decor inspired by the city’s rich history, the hotel offers a unique and immersive experience reminiscent of a scene from Bridgerton . The rooms are elegant and comfortable, with modern technology. There are only 166 rooms, making it a boutique hotel, adding to its charm. The best part, it’s a stone’s throw away from Bath’s major attractions, shops, and restaurants. Related: The Best Restaurants In London to Hit on Your Inevitable Stopover to Europe Related: Suborbital Flights: Fly From Sydney to London in Less Than Two Hours Read more stories from The Latch and subscribe to our email newsletter . Tags: Restaurants , Travel",
            "pubDate": "2023-06-27 06:09:18",
            "image_url": null,
            "source_id": "thelatch",
            "category": [
                "entertainment"
            ],
            "country": [
                "australia"
            ],
            "language": "english"
        },
        {
            "title": "Coldiretti, ricette italiane taroccate in 60% ristoranti, ecco gli orrori al Fancy Food",
            "link": "https://www.adnkronos.com/coldiretti-ricette-italiane-taroccate-in-60-ristoranti-ecco-gli-orrori-al-fancy-food_7BJxjayZK8VZkJwe0cvuL5",
            "keywords": [
                "salute"
            ],
            "creator": [
                "webinfo@adnkronos.com (Web Info)"
            ],
            "video_url": null,
            "description": "(Adnkronos) - Dato emerge dall’analisi Coldiretti/Notosondaggi divulgata in occasione del Summer Fancy Food 2023 di New York City",
            "content": "Sei italiani su dieci (60%) in viaggio all’estero per lavoro o in vacanza si sono imbattuti almeno una volta in un piatto o una specialità Made in Italy taroccati. E’ quanto emerge dall’analisi Coldiretti/Notosondaggi divulgata in occasione del Summer Fancy Food 2023 di New York City il più importante evento fieristico mondiale dedicato alle specialità alimentari presso il Javits Center dove al Padiglione Italia (level 3, stand n.2718) Coldiretti, Campagna Amica e Filiera Italia mettono a confronto per la prima volta le autentiche specialità nazionali con le brutte copie di imitazione mentre i cuochi contadini dimostreranno la differenza tra i veri piatti della tradizione gastronomica tricolore e quelli storpiate all’estero con ricette improponibili. Una occasione per sostenere la candidatura della pratica della cucina italiana per l’iscrizione nella Lista rappresentativa dei patrimoni culturali immateriali dell’umanità dell’Unesco che – ricordano Coldiretti e Filiera Italia - si svolge dopo l’approvazione da parte del Governo del Disegno di Legge su “Disposizioni organiche per la valorizzazione, la promozione e la tutela del Made in Italy che prevede l’istituzione di un ente per la certificazione di qualità a favore della ristorazione italiana all'estero con ben l’87% degli italiani ritiene importante per verificare la reale origine dei piatti serviti. Non è un caso, sottolineano Coldiretti e filiera Italia, che la ricetta più popolare negli Usa sia “macaroni and cheese” e si ottiene cucinando la pasta con una salsa a base di formaggio, molto spesso cheddar di produzione statunitense. Si tratta di una pasta cotta al forno in una salsa di besciamella e formaggio che sembra derivare da un vecchio libro di cucina italiana del 14esimo secolo. Un esempio illuminante della trasformazione che subiscono i piatti della tradizione tricolore nel nuovo continente. Un vero sacrilegio, continuano Coldiretti e Filiera Italia, è considerata in Italia la pizza all’ananas che invece in America è apprezzatissima, specialmente con aggiunta di prosciutto al pari degli spaghetti bolognese con le polpette di carne servite come piatto unico che sono un must della cucina italo-americana anche se in Italia non esiste. Per non parlare della carbonara che negli Usa preparano bacon al posto del guanciale e la panna o lo yogurt per dare consistenza o delle lasagne che vengono servite la l’immancabile presenza della ricotta. Molto diffuso da parte degli americani è infatti l’uso improprio di ingredienti della tradizione Made in Italy come il pesto che viene usato come una salsa da usare su tutto, dai crostini al pane fino al pollo. Stesso discorso vale per il Parmigiano, in nove casi su dieci consumato nella versione taroccata del Parmesan del Wisconsin. Non mancano – precisano Coldiretti e Filiera Italia - le varianti di ricette della tradizione popolari come la bruschetta che negli Usa si è trasformata nel garlic bread con il pane imbottito di pezzi di aglio o annegato nel burro aromatizzato all'aglio. E se in Italia il condimento immancabile e a base di olio extravergine di oliva, per l’Italian dressing a stelle e strisce non esistono davvero limiti con le combinazioni più fantasiose a partire dall’olio di soia. Una flessibilità che riguarda anche i piatti più semplici della tradizione tricolore come la caprese con la versione americana che utilizza la mozzarella di produzione locale, molto diversa da quella italiana e non solo nella forma. “La mancanza di chiarezza sulle ricette Made in Italy offre terreno fertile alla proliferazione di falsi prodotti alimentari italiani” è per questo è importante fare chiarezza sulla cucina italiana nel mondo con il riconoscimento come patrimonio Unesco” conclude il presidente della Coldiretti Ettore Prandini nel precisare che al valore culturale si aggiunge quello economico ed occupazionale per il Paese”.",
            "pubDate": "2023-06-27 06:04:02",
            "image_url": "https://www.adnkronos.com/resources/0282-185aa203563f-d5ea3d99c7f5-1000/format/medium/625is8x7.jpeg",
            "source_id": "adnkronos",
            "category": [
                "health"
            ],
            "country": [
                "italy"
            ],
            "language": "italian"
        },
        {
            "title": "KFC Operator Sapphire Foods Shares Gain After Multiple Large Trades",
            "link": "https://www.bqprime.com/markets/kfc-operator-sapphire-foods-shares-gain-after-multiple-large-trades",
            "keywords": [
                "Sapphire Foods India Ltd",
                "Market Wrap",
                "bqfree"
            ],
            "creator": [
                "Agnidev Bhattacharya"
            ],
            "video_url": null,
            "description": "At least 30 lakh shares, or 4.76% equity, changed hands in 12 large trades, according to Bloomberg data.",
            "content": "Shares of Sapphire Foods India Ltd. gained over 4% on Tuesday after multiple large trades.At least 30 lakh shares, or 4.76% equity, changed hands in 12 large trades, according to Bloomberg data. The buyers were not immediately known.WWD Ruby Ltd. had previously offered 30 lakh shares of Sapphire Foods, representing its entire stake in the company, at Rs 1,345-1,391 apiece, according to Bloomberg. The price range represents up to 3.3%... Shares of Sapphire Foods India Ltd. gained over 4% on Tuesday after multiple large trades. At least 30 lakh shares, or 4.76% equity, changed hands in 12 large trades, according to Bloomberg data. The buyers were not immediately known. WWD Ruby Ltd. had previously offered 30 lakh shares of Sapphire Foods, representing its entire stake in the company, at Rs 1,345-1,391 apiece, according to Bloomberg. The price range represents up to 3.3% discount on the stock's last close on the NSE. WWD Ruby Ltd. owns 4.76% stake in the company as of March 31, while Sapphire Foods Mauritius Ltd. holds 31.88%, according to Bloomberg data. Sapphire Foods has a restaurant operating business in the Indian subcontinent, with more than 400 KFC, Pizza Hut and Taco Bell restaurants under their management across India, Sri Lanka and the Maldives. Facebook Twitter Shares of Sapphire Foods surged 4.17% to Rs 1,449 apiece, before paring gains to trade 0.93% higher at Rs 1,403.95 apiece as of 9:45 a.m., compared with a 0.23% rise in the NSE Nifty 50. The average traded volume so far in the day stood at 71.8 times its monthly average. The relative strength index was at 55.59. Out of the 16 analysts tracking the company, 12 maintain a 'buy' rating, two recommend 'hold' and two suggest a 'sell' on the stock, according to Bloomberg data.",
            "pubDate": "2023-06-27 04:27:44",
            "image_url": null,
            "source_id": "bloombergquint",
            "category": [
                "business"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        }
    ],
    "nextPage": "16878400647a942a045195ad877e9775fc58a974f8"
}
